In [1]:
import pandas as pd

In [2]:
import matplotlib.pyplot as plt

ImportError: No module named 'matplotlib'

In [3]:
import matplotlib.pyplot as plt

ImportError: No module named 'matplotlib'

In [4]:
## Baby Names
names =['Bob','Jessica', 'Mary','John','Mel']
births=[968,155,77,578, 793]

In [5]:
names

['Bob', 'Jessica', 'Mary', 'John', 'Mel']

In [6]:
births

[968, 155, 77, 578, 793]

In [8]:
BabyDataSet=list(zip(names,births))
BabyDataSet

[('Bob', 968), ('Jessica', 155), ('Mary', 77), ('John', 578), ('Mel', 793)]

In [11]:
df=pd.DataFrame(data=BabyDataSet, columns=['names','births'])
df

     names  births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     793

In [24]:
df.to_csv?

In [29]:
df.to_csv('births1880.csv', header=None, index=False)

In [15]:
df.read_csv?

Object `df.read_csv` not found.

In [16]:
to_csv?

Object `to_csv` not found.

In [17]:
read_csv?

Object `read_csv` not found.

In [19]:
pd.read_csv?

In [31]:
df=pd.read_csv('births1880.csv')
df

   0      Bob  968
0  1  Jessica  155
1  2     Mary   77
2  3     John  578
3  4      Mel  793

In [22]:
df=pd.read_csv('births1880.csv',header=None)
df

     0        1       2
0  NaN    names  births
1  0.0      Bob     968
2  1.0  Jessica     155
3  2.0     Mary      77
4  3.0     John     578
5  4.0      Mel     793

In [30]:
df=pd.read_csv('births1880.csv',header=None)
df

   0        1    2
0  0      Bob  968
1  1  Jessica  155
2  2     Mary   77
3  3     John  578
4  4      Mel  793

In [34]:
df=pd.read_csv('births1880.csv',header=None,names=['Names','Births'])
df

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     793

In [35]:
import os

In [36]:
import os
os.remove('births1880.csv')

In [39]:
df.dtypes

Names     object
Births     int64
dtype: object

In [41]:
df.Births.dtypes

dtype('int64')

In [42]:
# Popular name
ord =df.sort_values(['Births'],ascending=False)

In [44]:
ord.head(1)

  Names  Births
0   Bob     968

In [46]:
df['Births'].max()

968

df.sort_values()?

In [48]:
sort_values()

NameError: name 'sort_values' is not defined

## Day 2

In [53]:
randon.seed?

Object `randon.seed` not found.

In [54]:
random.seed?

Object `random.seed` not found.

In [51]:
random.seed?

Object `random.seed` not found.

In [52]:
random.randint?

Object `random.randint` not found.

In [79]:
##https://pynative.com/python-random-seed/
## random.seed() then random.randint to generate value. Seed decides to repeat random number
import random
random.seed(500)

In [95]:
random_name=[]
random.seed(500)
for i in range(1000):
    random_name.append(names[random.randint(0,len(names)-1)])

In [96]:
random_name[:10]

['John', 'Mel', 'Mel', 'John', 'Mary', 'John', 'Jessica', 'Bob', 'Mary', 'Mel']

In [97]:
births=[]
random.seed(500)
for i in range(1000):
    births.append(random.randint(0,1000))

In [98]:
births[:10]

[816, 472, 972, 539, 592, 479, 261, 650, 774, 714]

In [99]:
BabyDataSet=list(zip(random_name,births))

In [100]:
BabyDataSet[:10]

[('John', 816),
 ('Mel', 472),
 ('Mel', 972),
 ('John', 539),
 ('Mary', 592),
 ('John', 479),
 ('Jessica', 261),
 ('Bob', 650),
 ('Mary', 774),
 ('Mel', 714)]

In [101]:
df=pd.DataFrame(data=BabyDataSet, columns=['Name','Births'])

In [102]:
df[:10]

      Name  Births
0     John     816
1      Mel     472
2      Mel     972
3     John     539
4     Mary     592
5     John     479
6  Jessica     261
7      Bob     650
8     Mary     774
9      Mel     714

In [103]:
df.to_csv?

In [104]:
df.to_csv('births1880.txt',index=False, header=False)

In [105]:
Loc=r'C:\Users\469422\births1880.txt'

In [106]:
df.read_csv?

Object `df.read_csv` not found.

In [107]:
df=pd.read_csv(Loc)

In [108]:
df[:10]

      John  816
0      Mel  472
1      Mel  972
2     John  539
3     Mary  592
4     John  479
5  Jessica  261
6      Bob  650
7     Mary  774
8      Mel  714
9      Bob  384

In [109]:
df.describe()

              816
count  999.000000
mean   495.723724
std    282.317556
min      0.000000
25%    263.000000
50%    497.000000
75%    736.000000
max    996.000000

In [110]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999 entries, 0 to 998
Data columns (total 2 columns):
John    999 non-null object
816     999 non-null int64
dtypes: int64(1), object(1)
memory usage: 15.7+ KB

In [111]:
df.head()

   John  816
0   Mel  472
1   Mel  972
2  John  539
3  Mary  592
4  John  479

In [112]:
df=pd.read_csv(Loc,header=None)

In [113]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
0    1000 non-null object
1    1000 non-null int64
dtypes: int64(1), object(1)
memory usage: 15.7+ KB

In [114]:
df.tail()

           0    1
995  Jessica  133
996     Mary  839
997  Jessica  810
998     John  827
999      Mel  777

In [116]:
df=pd.read_csv(Loc,names=['Name','Births'])
df[:10]

      Name  Births
0     John     816
1      Mel     472
2      Mel     972
3     John     539
4     Mary     592
5     John     479
6  Jessica     261
7      Bob     650
8     Mary     774
9      Mel     714

In [117]:
df['Name'].unique()

array(['John', 'Mel', 'Mary', 'Jessica', 'Bob'], dtype=object)

In [118]:
df.describe()

            Births
count  1000.000000
mean    496.044000
std     282.357922
min       0.000000
25%     264.000000
50%     498.000000
75%     737.000000
max     996.000000

In [119]:
df['Name'].describe()

count     1000
unique       5
top       Mary
freq       220
Name: Name, dtype: object

In [130]:
gp = df.groupby(['Name'])['Births'].sum()
gp

Name
Bob         93487
Jessica     91208
John        98041
Mary       107609
Mel        105699
Name: Births, dtype: int64

In [131]:
Sorted = gp.sort_values(ascending=False)
Sorted.head(1)

Name
Mary    107609
Name: Births, dtype: int64

In [132]:
gp.max()

107609

In [133]:
gp['Births'].max()

KeyError: 'Births'